app/Controllers/Registros.php

                    "llave_secreta" => str_replace('$', 'o', $llave_secreta)
                );
                $model = new RegistrosModel();
                $registro = $model->insert($datos);
---
INSERT INTO `registros` (`nombres`, `apellidos`, `email`, `cliente_id`, `llave_secreta`) VALUES ('meshiii', 'orrrego', 'cale@gmail.com', 'a2aa07adfhdfrexfhgdfhdferttgeh8j5KbNB2teRmdzcOG0.yK0Y1IORhV2', 'o2ao07odfhdfrexfhgdfhdferttgeV/SJPhcqr8.ivYaLPO5GNwGoIwiCBMK')