app/Controllers/Tiendas.php

    public function index(){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $superadmin = $model->where('estado', 1)->findAll();
---
SELECT *
FROM `registros`
WHERE `estado` = 1

    public function show ($id){
        $request = \Config\Services::request();
        $validation = \Config\Services::validation();
        $headers = $request->getHeaders();
        $model = new RegistrosModel();
        $superadmin = $model->where('estado', 1)->findAll();
---
SELECT *
FROM `registros`
WHERE `estado` = 1